Revit 2024 API
ProgressChangedEventArgs.Position Property
 Progress bar position - value is always between zero and upperRange and is incremented by one with each event of stage "PositionChanged"
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public int Position { get; }
Visual Basic
Public ReadOnly Property Position As Integer
	Get
Visual C++
public:
property int Position {
	int get ();
}
See Also
ProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace